List<Map<String, dynamic>> questions = [
  {
    "title": "كم كان عمر النبي محمد صلى "
        "الله عليه وسلم عندما توفيت أمه ؟ ",
    "answers": [" 3 سنوات", " 4 سنوات  ", "5 سنوات", "6 سنوات  "],
    "correctAnswer": "5 سنوات",
    "selectAnswer": null,
  },
  {
    "title": " كم عدد التكبيرات في الركعة الأولى في صلاة العيد؟ ",
    "answers": ["ستة", "سبعة", " تسعة ", "خمسة"],
    "correctAnswer": "سبعة",
    "selectAnswer": null,
  },
  {
    "title": " ما هي أطول سورة في القرآن الكريم؟",
    "answers": [" سورة البقره", "سورة النساء ", "سورة المائده", "سورة الكهف"],
    "correctAnswer": "سورة البقره",
    "selectAnswer": null,
  },
  {
    "title": "ما السورة التي ختمت باسم وقت من أوقات الصلاة؟",
    "answers": [" سورة القدر", "سورة البلد ", "سورة الأعلى", "سورة الفجر"],
    "correctAnswer": "سورة الأعلى",
    "selectAnswer": null,
  },
  {
    "title": " كم عدد التكبيرات في الركعة الأولى في صلاة العيد؟ ",
    "answers": ["ستة", "سبعة", " تسعة ", "خمسة"],
    "correctAnswer": "سبعة",
    "selectAnswer": null,
  },

];
